from string import Template

### RAG PROMPTS IN ARABIC ###

# System Prompt
system_prompt = Template(
    "\n".join([
    "أنت مساعد ذكي مهمته توليد إجابة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستعلام المستخدم.",
    "يجب عليك توليد إجابة استنادًا فقط إلى المستندات المقدمة.",
    "تجاهل أي مستندات لا تتعلق باستعلام المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد إجابة مناسبة.",
    "يجب أن تكون الإجابة بنفس لغة استعلام المستخدم.",
    "كن مهذبًا ومحترمًا في إجاباتك.",
    "كن دقيقًا ومختصرًا في ردك. تجنب تقديم معلومات غير ضرورية."
    ])
)

# Document Prompt
document_prompt = Template(   # When you call it, pass doc_num and chunk_text
    "\n".join([
        "## رقم المستند: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)

# Footer Prompt
footer_prompt = Template(
    "\n".join([
        "بناءً فقط على المستندات أعلاه، الرجاء توليد إجابة للمستخدم.",
        "## السؤال:",
        "$query",
        "",
        "## الإجابة:",
    ])
)
